<?php
/**
 * Persian translation : Validation messages
 */
return [
    'notfound' => 'داده مورد نظر یافت نشد',
    'required' => 'وارد کردن این فیلد الزامیست',
    'mobile'            => [
        'required' => 'شماره تلفن همراه ضروری می‌باشد',
        'regex'    => 'شماره تلفن همراه معتبر نیست',
        'unique'   => 'شماره تلفن همراه ارسالی قبلا ثبت شده است',
        'exists'   => 'شماره تلفن همراه ارسالی در سیستم ثبت نشده است',
    ],
    'first_name'            => [
        'required' => 'وارد کردن نام الزامیست',
        'max'    => 'نام حداکثر میبایست 50 کاراکتر باشد',
        'min'    => 'نام حداقل میبایست 2 کاراکتر باشد',
    ],
    'last_name'            => [
        'required' => 'وارد کردن نام خانوادگی الزامیست',
        'max'    => 'نام خانوادگی حداکثر میبایست 50 کاراکتر باشد',
        'min'    => 'نام خانوادگی حداقل میبایست 2 کاراکتر باشد',
    ],
    'email'            => [
        'required' => 'وارد کردن ایمیل الزامیست',
        'email' => 'لطفا ایمیل معتبر وارد کنید',
    ],
    'password'            => [
        'required' => 'وارد کردن پسورد الزامیست',
        'confirmed' => 'تکرار پسورد مطابقت ندارد',
        'min'    => 'حداقل میبایست 8 کاراکتر باشد',
    ],
    'verification-code'  => [
        'required' => 'کد ورود الزامی است',
    ],
    'user'              => [
        'notfound' => 'کاربر مورد نظر یافت نشد',
        'exists'   => 'کاربر مورد نظر یافت نشد',
    ],
];

